Repository: yurtemre7/paren
Catalog: lib/l10n/app_*.arb
Languages: hi, id, ja

source: Hello World!
hi: नमस्ते दुनिया!
id: Halo Dunia!
ja: Konnichiwa minnasan!

source: Sheets
hi: शीट्स
id: Lembaran
ja: シート

source: Calculation
hi: गणना
id: Perhitungan
ja: 計算

source: Settings
hi: सेटिंग्स
id: Pengaturan
ja: 設定

source: Search Sheets
hi: शीट्स खोजें
id: Cari Lembaran
ja: シートを検索

source: Edit
hi: संपादित करें
ja: 編集

source: Save
hi: सहेजें
id: Simpan
ja: 保存

source: Search
hi: खोजें
id: Cari
ja: 検索

source: Hide search
hi: खोज छिपाएं
id: Sembunyikan pencarian
ja: 検索を隠す

# sheetCount
source: {count, plural, =0 {No sheets found} =1 {1 sheet found} other {{count} sheets found}}
hi: {count, plural, =0 {कोई शीट नहीं मिली} =1 {1 शीट मिली} other {{count} शीट्स मिलीं}}
id: {count, plural, =0 {Tidak ada lembaran ditemukan} =1 {1 lembaran ditemukan} other {{count} lembaran ditemukan}}
ja: {count, plural, =0 {シートが見つかりません} =1 {1つのシートが見つかりました} other {{count}つのシートが見つかりました}}

# deleteSheetTitle
source: Delete Sheet
hi: शीट हटाएं
id: Hapus Lembaran
ja: シートを削除

# deleteSheetContent
source: Are you sure you want to delete your Sheet "{name}" containing {entryCount, plural, =0 {0 entries} =1 {1 entry} other {{entryCount} entries}}?
hi: क्या आप अपनी शीट "{name}" को हटाना चाहते हैं जिसमें {entryCount, plural, =0 {0 प्रविष्टियाँ} =1 {1 प्रविष्टि} other {{entryCount} प्रविष्टियाँ}} हैं?
id: Apakah Anda yakin ingin menghapus Lembaran "{name}" Anda yang berisi {entryCount, plural, =0 {0 entri} =1 {1 entri} other {{entryCount} entri}}?
ja: 本当にシート「{name}」を削除しますか？{entryCount, plural, =0 {0個のエントリ} =1 {1個のエントリ} other {{entryCount}個のエントリ}}が含まれています。

source: Confirm
hi: पुष्टि करें
id: Konfirmasi
ja: 確認

source: Cancel
hi: रद्द करें
id: Batal
ja: キャンセル

# deletedSheet
source: Deleted "{name}"
hi: "{name}" हटा दिया गया
id: Telah dihapus "{name}"
ja: 「{name}」を削除しました

# updatedSheet
source: Updated "{name}"
hi: "{name}" अपडेट किया गया
id: Telah diperbarui "{name}"
ja: 「{name}」を更新しました

# createdSheet
source: Created "{name}"
hi: "{name}" बनाया गया
id: Telah dibuat "{name}"
ja: 「{name}」を作成しました

source: No sheets found
hi: कोई शीट नहीं मिली
id: Tidak ada lembaran ditemukan
ja: シートが見つかりません

# madeInGermanyByEmre
source: Made in 🇩🇪 by Emre
hi: जर्मनी 🇩🇪 में एमरे द्वारा बनाया गया
id: Dibuat di 🇩🇪 oleh Emre
ja: ドイツ製 Emre作

# appColorAndTheme
source: App Color & Theme
hi: ऐप रंग और थीम
id: Warna & Tema Aplikasi
ja: アプリの色とテーマ

source: App Color
hi: ऐप रंग
id: Warna Aplikasi
ja: アプリの色

source: App Language
hi: ऐप भाषा
id: Bahasa Aplikasi
ja: アプリの言語

source: Pick a color
hi: एक रंग चुनें
id: Pilih warna
ja: 色を選択

source: Share the App
hi: ऐप साझा करें
id: Bagikan Aplikasi
ja: アプリを共有

# shareAppSubtitle
source: With your help the app can help more people on their vacations! I appreciate your effort.
hi: आपकी मदद से ऐप छुट्टियों में और अधिक लोगों की मदद कर सकता है! मैं आपकी मेहनत की सराहना करता हूँ।
id: Dengan bantuan Anda, aplikasi ini dapat membantu lebih banyak orang dalam liburan mereka! Saya menghargai usaha Anda.
ja: あなたの協力で、より多くの人が旅行中にこのアプリを利用できます！ご協力ありがとうございます。

# shareAppText
source: With Par円 you can convert money in your travels faster than ever! Download here: https://apps.apple.com/us/app/paren/id6578395712
hi: पार円 के साथ आप अपनी यात्राओं में पैसा बदलने में कभी से ज्यादा तेजी से कर सकते हैं! यहाँ डाउनलोड करें: https://apps.apple.com/us/app/paren/id6578395712
id: Dengan Par円 Anda dapat mengkonversi uang dalam perjalanan Anda lebih cepat dari sebelumnya! Unduh di sini: https://apps.apple.com/us/app/paren/id6578395712
ja: Par円を使えば、旅行中のお金の換算がこれまで以上に速くなります！ ダウンロードはこちら: https://apps.apple.com/us/app/paren/id6578395712

source: Contact / Feedback
hi: संपर्क / प्रतिक्रिया
id: Kontak / Umpan Balik
ja: お問い合わせ / フィードバック

# contactFeedbackSubtitle
source: Feel free to reach out to me, as I take any request seriously and see it as an opportunity to improve my app.
hi: मुझसे संपर्क करने में संकोच न करें, क्योंकि मैं किसी भी अनुरोध को गंभीरता से लेता हूँ और इसे अपने ऐप को बेहतर बनाने का अवसर मानता हूँ।
id: Jangan ragu untuk menghubungi saya, karena saya menganggap setiap permintaan secara serius dan melihatnya sebagai kesempatan untuk meningkatkan aplikasi saya.
ja: どんなリクエストも真剣に受け止め、アプリ改善の機会としていますので、お気軽にお問い合わせください。

source: Licenses
hi: लाइसेंस
id: Lisensi
ja: ライセンス

# licensesSubtitle
source: This app uses the following open source libraries.
hi: यह ऐप निम्नलिखित ओपन सोर्स लाइब्रेरीज का उपयोग करता है।
id: Aplikasi ini menggunakan pustaka sumber terbuka berikut.
ja: このアプリは以下のオープンソースライブラリを使用しています。

source: GitHub
hi: गिटहब

source: E-Mail
hi: ई-मेल
ja: メール

source: App Info
hi: ऐप जानकारी
id: Info Aplikasi
ja: アプリ情報

source: Thank you for being here.
hi: यहाँ होने के लिए धन्यवाद।
id: Terima kasih telah berada di sini.
ja: ご利用ありがとうございます。

source: Delete App Data
hi: ऐप डेटा हटाएं
id: Hapus Data Aplikasi
ja: アプリデータを削除

# deleteAppDataContent
source: Are you sure, you want to delete all the app data? This contains the data of the offline currency values, your default currency selection and the autofocus status.
hi: क्या आप सभी ऐप डेटा हटाना चाहते हैं? इसमें ऑफ़लाइन मुद्रा मानों का डेटा, आपका डिफ़ॉल्ट मुद्रा चयन और ऑटोफ़ोकस स्थिति शामिल है।
id: Apakah Anda yakin ingin menghapus semua data aplikasi? Ini berisi data nilai mata uang offline, pilihan mata uang default Anda, dan status autofokus.
ja: 本当にすべてのアプリデータを削除しますか？ これにはオフライン通貨値、デフォルト通貨選択、オートフォーカス状態のデータが含まれます。

source: Abort
hi: छोड़ें
id: Batalkan
ja: 中止

source: Delete
hi: हटाएं
id: Hapus
ja: 削除

# fromWhereDoWeFetchData
source: From where do we fetch the data?
hi: हम डेटा कहाँ से लाते हैं?
id: Dari mana kami mengambil data?
ja: データはどこから取得していますか？

# weUseApiFrom
source: We use the API provided from
hi: हम एपीआई का उपयोग करते हैं जो यहाँ से प्रदान किया गया है
id: Kami menggunakan API yang disediakan dari
ja: 使用しているAPI:

source: Frankfurter
hi: फ्रैंकफर्टर

# openSourceAndFree
source: which is open source and free to use. It gets its data from the
hi: जो ओपन सोर्स और उपयोग के लिए नि: शुल्क है। यह डेटा प्राप्त करता है
id: yang bersifat sumber terbuka dan gratis digunakan. Data tersebut berasal dari
ja: これはオープンソースで無料です。 データは

source: European Central Bank
hi: यूरोपीय केंद्रीय बैंक
id: Bank Sentral Eropa
ja: 欧州中央銀行

# trustedSource
source: , which is a trusted source. Also, we only need to fetch the data once a day, so the App only fetches it, if that duration has passed from the previous fetch. But you can force refresh by pulling from the top. To update the values in the widgets, just simply open the app once that day.
hi: से, जो एक विश्वसनीय स्रोत है। इसके अलावा, हमें केवल एक बार एक दिन में डेटा लाने की आवश्यकता होती है, इसलिए ऐप केवल तभी डेटा लाता है जब पिछली बार के बाद वह अवधि बीत चुकी हो। लेकिन आप ऊपर से खींचकर ताज़ा कर सकते हैं। विजेट्स में मान अपडेट करने के लिए, उस दिन बस एक बार ऐप खोलें।
id: , yang merupakan sumber tepercaya. Juga, kami hanya perlu mengambil data sekali sehari, jadi Aplikasi hanya mengambilnya jika durasi itu telah berlalu dari pengambilan sebelumnya. Tetapi Anda dapat memaksa penyegaran dengan menarik dari atas. Untuk memperbarui nilai-nilai dalam widget, cukup buka aplikasi sekali sehari itu.
ja: から取得しており、信頼性があります。 1日1回しかデータを取得する必要がないため、前回の取得から期間が経過した場合のみアプリが取得します。上からプルダウンすることで強制的に更新できます。 ウィジェットの値を更新するには、その日に1度アプリを開くだけでOKです。

# currenciesLastUpdated
source: Currencies last updated: {timestamp}
hi: मुद्राओं का अंतिम अपडेट: {timestamp}
id: Mata uang terakhir diperbarui: {timestamp}
ja: 通貨最終更新日時: {timestamp}

# currenciesEmptyError
source: Currencies is empty, an error must have occurred.
hi: मुद्राएँ खाली हैं, एक त्रुटि हुई होगी।
id: Mata uang kosong, mungkin terjadi kesalahan.
ja: 通貨が空です。エラーが発生した可能性があります。

source: Operation timed out
hi: ऑपरेशन का समय समाप्त हो गया
id: Operasi habis waktu
ja: 操作がタイムアウトしました

source: An error has occurred
hi: एक त्रुटि हुई है
id: Terjadi kesalahan
ja: エラーが発生しました

# loadingTimeTaken
source: Loading time taken: {duration}ms
hi: लोड होने में समय लगा: {duration}मिलीसेकंड
id: Waktu pemuatan: {duration}ms
ja: 読み込み時間: {duration}ms

# exchangeChart
source: {fromCurrency} - {toCurrency} exchange chart
hi: {fromCurrency} - {toCurrency} विनिमय चार्ट
id: Grafik pertukaran {fromCurrency} - {toCurrency}
ja: {fromCurrency} - {toCurrency} 為替チャート

# chartDoesNotExist
source: Chart does not exist with this configuration.
hi: इस कॉन्फ़िगरेशन के साथ चार्ट मौजूद नहीं है।
id: Grafik tidak tersedia dengan konfigurasi ini.
ja: この構成ではチャートが存在しません。

source: Quick Conversions
hi: त्वरित रूपांतरण
id: Konversi Cepat
ja: クイック変換

source: Saved Conversions
hi: सहेजे गए रूपांतरण
id: Konversi Tersimpan
ja: 保存された変換

source: Budget Planner
hi: बजट योजनाकर्ता
id: Perencana Anggaran
ja: 予算プランナー

source: Favorite
hi: पसंदीदा
id: Favorit
ja: お気に入り

source: Share
hi: साझा करें
id: Bagikan
ja: 共有

source: Copy
hi: कॉपी करें
id: Salin
ja: コピー

source: Adjust Sizes
hi: आकार समायोजित करें
id: Sesuaikan Ukuran
ja: サイズ調整

source: Primary Conversion
hi: प्राथमिक रूपांतरण
id: Konversi Utama
ja: 主要変換

source: Secondary Conversion
hi: माध्यमिक रूपांतरण
id: Konversi Sekunder
ja: 二次変換

source: Calculator Input Height
hi: कैलकुलेटर इनपुट ऊंचाई
id: Tinggi Input Kalkulator
ja: 電卓入力高さ

# copiedToClipboard
source: {text} was copied to the clipboard
hi: {text} क्लिपबोर्ड पर कॉपी किया गया था
id: {text} telah disalin ke papan klip
ja: {text} をクリップボードにコピーしました

source: Add
hi: जोड़ें
id: Tambah

source: Update
hi: अपडेट करें
id: Perbarui

source: Add Entry
hi: प्रविष्टि जोड़ें
id: Tambah Entri
ja: エントリ追加

source: Description
hi: विवरण
id: Deskripsi
ja: 説明

source: Amount in {currency}
hi: {currency} में राशि
id: Jumlah dalam {currency}
ja: {currency}での金額

source: Date
hi: तारीख
id: Tanggal
ja: 日付

# originalCreated
source: Original Created: {date}
hi: मूल रूप से बनाया गया: {date}
id: Dibuat Awal: {date}
ja: 作成日: {date}

# updated
source: Updated: {date}
hi: अपडेट किया गया: {date}
id: Diperbarui: {date}
ja: 更新日: {date}

source: Sort it
hi: क्रमबद्ध करें
id: Urutkan
ja: 並べ替え

source: Sort by
hi: इसके अनुसार क्रमबद्ध करें
id: Urutkan berdasarkan
ja: 並べ替え方法

# clickAgainToReverse
source: Click again to reverse the sorting
hi: क्रमबद्ध करने को उल्टा करने के लिए फिर से क्लिक करें
id: Klik lagi untuk membalikkan pengurutan
ja: もう一度クリックすると並べ替えを反転します

source: by name
hi: नाम के अनुसार
id: berdasarkan nama
ja: 名前順

source: by date
hi: तारीख के अनुसार
id: berdasarkan tanggal
ja: 日付順

source: by amount
hi: राशि के अनुसार
id: berdasarkan jumlah
ja: 金額順

source: No entries yet
hi: अभी तक कोई प्रविष्टि नहीं
id: Belum ada entri
ja: まだエントリがありません

source: Statistics
hi: आंकड़े
id: Statistik
ja: 統計

source: Total:
hi: कुल:
ja: 合計:

source: Average:
hi: औसत:
id: Rata-rata:
ja: 平均:

source: Minimum:
hi: न्यूनतम:
ja: 最小:

source: Maximum:
hi: अधिकतम:
id: Maksimum:
ja: 最大:

# amountConvertedHeader
source: Amount ({currency}) / Converted ({convertedCurrency})
hi: राशि ({currency}) / रूपांतरित ({convertedCurrency})
id: Jumlah ({currency}) / Dikonversi ({convertedCurrency})
ja: 金額 ({currency}) / 換算後 ({convertedCurrency})

# themeSystem
source: System
hi: सिस्टम
id: Sistem
ja: システム

# themeLight
source: Light
hi: हल्का
id: Terang
ja: ライト

# themeDark
source: Dark
hi: गहरा
id: Gelap
ja: ダーク

# weekdayMon
source: MON
hi: सोम
id: SEN
ja: 月

# weekdayTue
source: TUE
hi: मंगल
id: SEL
ja: 火

# weekdayWed
source: WED
hi: बुध
id: RAB
ja: 水

# weekdayThu
source: THU
hi: गुरु
id: KAM
ja: 木

# weekdayFri
source: FRI
hi: शुक्र
id: JUM
ja: 金

# weekdaySat
source: SAT
hi: शनि
id: SAB
ja: 土

# weekdaySun
source: SUN
hi: रवि
id: MIN
ja: 日

# weekdayDay
source: DAY
hi: दिन
id: HARI
ja: 曜日

# monthJan
source: JAN
hi: जन
ja: 1月

# monthFeb
source: FEB
hi: फर

# monthMar
source: MAR
hi: मार्च
ja: 3月

# monthApr
source: APR
hi: अप्र

# monthMay
source: MAY
hi: मई
id: MEI
ja: 5月

# monthJun
source: JUN
hi: जून

# monthJul
source: JUL
hi: जुल
ja: 7月

# monthAug
source: AUG
hi: अग
id: AGU

# monthSep
source: SEP
hi: सित
ja: 9月

# monthOct
source: OCT
hi: अक्टू
id: OKT

# monthNov
source: NOV
hi: नव
ja: 11月

# monthDec
source: DEC
hi: दिस
id: DES

source: Trip Budget
hi: यात्रा बजट
id: Anggaran Perjalanan
ja: 旅行予算

source: Total Budget
hi: कुल बजट
id: Total Anggaran
ja: 総予算

source: Per-Day Budget
hi: प्रति दिन बजट
id: Anggaran Per-Hari
ja: 1日あたりの予算

source: Select Currency
hi: मुद्रा चुनें
id: Pilih Mata Uang
ja: 通貨を選択

source: Search currency
hi: मुद्रा खोजें
id: Cari mata uang
ja: 通貨を検索

source: No results found
hi: कोई परिणाम नहीं मिला
id: Tidak ada hasil ditemukan
ja: 結果が見つかりません

source: Edit Sheet
hi: शीट संपादित करें
id: Edit Lembaran
ja: シートを編集

source: Create New Sheet
hi: नई शीट बनाएं
id: Buat Lembaran Baru
ja: 新しいシートを作成

source: Sheet Name
hi: शीट का नाम
id: Nama Lembaran
ja: シート名

# enterSheetName
source: Enter a name for your sheet
hi: अपनी शीट के लिए एक नाम दर्ज करें
id: Masukkan nama untuk lembaran Anda
ja: シートの名前を入力してください

source: Update Sheet
hi: शीट अपडेट करें
id: Perbarui Lembaran
ja: シートを更新

source: Create Sheet
hi: शीट बनाएं
id: Buat Lembaran
ja: シートを作成

# noConversionsSaved
source: No conversions saved yet.
hi: अभी तक कोई रूपांतरण सहेजा नहीं गया है।
id: Belum ada konversi yang disimpan.
ja: まだ変換が保存されていません。

source: Select duration
hi: अवधि चुनें
id: Pilih durasi
ja: 期間を選択

source: days
hi: दिन
id: hari
ja: 日

source: Show simple prediction
hi: सरल भविष्यवाणी दिखाएं
id: Tampilkan prediksi sederhana
ja: 簡単な予測を表示

# predictionFunDisclaimer
source: This is just for fun, no financial advice.
hi: यह केवल मज़े के लिए है, कोई वित्तीय सलाह नहीं।
id: Ini hanya untuk hiburan, bukan nasihat keuangan.
ja: これは単なる楽しみであり、金融アドバイスではありません。

source: How Predictions Work
hi: भविष्यवाणियाँ कैसे काम करती हैं
id: Cara Kerja Prediksi
ja: 予測の仕組み

# predictionExplanation
source: The prediction uses the last {days} days of data to estimate {predictionDays} days of future data. \n\n• It follows the average daily trend from historical data.\n• Adds realistic random fluctuations based on past volatility.\n• Shorter historical data ➜ shorter predictions -> less accuracy.\n• Longer historical data ➜ longer predictions -> higher accuracy.\n\n⚠️ This is a simplified model. Real-world rates may vary significantly!
hi: भविष्यवाणी पिछले {days} दिनों के डेटा का उपयोग करके भविष्य के {predictionDays} दिनों के डेटा का अनुमान लगाती है। \n\n• यह ऐतिहासिक डेटा से औसत दैनिक प्रवृत्ति का पालन करती है।\n• अतीत की अस्थिरता के आधार पर वास्तविक यादृच्छिक उतार-चढ़ाव जोड़ती है।\n• छोटा ऐतिहासिक डेटा ➜ छोटी भविष्यवाणियाँ -> कम सटीकता।\n• लंबा ऐतिहासिक डेटा ➜ लंबी भविष्यवाणियाँ -> अधिक सटीकता।\n\n⚠️ यह एक सरलीकृत मॉडल है। वास्तविक दुनिया की दरें काफी भिन्न हो सकती हैं!
id: Prediksi menggunakan data {days} hari terakhir untuk memperkirakan data {predictionDays} hari ke depan. \n\n• Ini mengikuti tren harian rata-rata dari data historis.\n• Menambahkan fluktuasi acak yang realistis berdasarkan volatilitas sebelumnya.\n• Data historis lebih pendek ➜ prediksi lebih pendek -> akurasi lebih rendah.\n• Data historis lebih panjang ➜ prediksi lebih panjang -> akurasi lebih tinggi.\n\n⚠️ Ini adalah model sederhana. Nilai-nilai di dunia nyata bisa sangat berbeda!
ja: 予測は過去{days}日間のデータを使用して、今後{predictionDays}日間のデータを推定します。 \n\n• 歴史的データからの平均的な日々の傾向に従います。\n• 過去のボラティリティに基づいた現実的なランダム変動を追加します。\n• 短い履歴データ ➜ 短い予測 -> 精度が低くなります。\n• 長い履歴データ ➜ 長い予測 -> 精度が高くなります。\n\n⚠️ これは簡略化されたモデルです。実際のレートは大きく異なる可能性があります！

source: OK
hi: ठीक है
id: OKE

source: Swap
hi: स्वैप
id: Tukar
ja: 交換

# dailyBudget
source: Daily Budget ({currency})
hi: दैनिक बजट ({currency})
id: Anggaran Harian ({currency})
ja: 1日あたりの予算 ({currency})

source: Select Trip Dates
hi: यात्रा की तारीखें चुनें
id: Pilih Tanggal Perjalanan
ja: 旅行日を選択

# tripDatesWithDuration
source: {startDate} - {endDate} ({duration} days)
hi: {startDate} - {endDate} ({duration} दिन)
id: {startDate} - {endDate} ({duration} hari)
ja: {startDate} - {endDate} ({duration} 日)

# totalLabel
source: Total:
hi: कुल:
ja: 合計:

# perDayLabel
source: Per day:
hi: प्रति दिन:
id: Per hari:
ja: 1日あたり:

source: Invalid currency
hi: अमान्य मुद्रा
id: Mata uang tidak valid
ja: 無効な通貨

source: Last update info
hi: अंतिम अपडेट जानकारी
id: Info pembaruan terakhir
ja: 最終更新情報
